{
  "_meta": {
    "maxChars": {
      "welcome": 20,
      "readyToPlay": 20,
      "pressContinue": 50,
      "greatJob": 20,
      "onePlusOne": 30
    }
  },
  "en": {
    "start": "START",
    "level": "Level",
    "play": "PLAY",
    "continue": "CONTINUE",
    "battle": "BATTLE",
    "level_title1": "Recessive Trait",
    "level_title2": "Dominant Trait",
    "level_title3": "Incomplete Dominant Trait",
    "level_title4": "Codominant Trait",
    "level_title5": "Polygenetic Trait",
    "level_title6": "Genemon Museum",
    "level_title7": "Genemon Arena",
    "tutorial_0_pre1" : "Welcome to the world of Genemon! A world filled with incredible creatures! My name is Professor Violet and I am here to guide you!",
    "tutorial_0_main1" : "Every Genemons have several traits that comes from something deep inside them — their genes. The combination of these genes make them unique and different!",
    "tutorial_0_main2" : "Genes are tiny instructions inside a Genemon’s body. They decide what traits it will have.",
    "tutorial_0_main3" : "For example, one of the trait of this Genemon is 'Small Claw', which has a particular <color=#0057B7>genotype</color>.",
    "tutorial_0_main4" : "The <color=#0057B7>genotype</color> is the complete set of genes and it includes all the genetic information inherited from both parents.",
    "tutorial_0_post1" : "Alright, I think you are ready now to start the adventure! Let's breed and battle Genemons!",
    "tutorial_1_pre1" : "The first thing you need to do is to choose a Genemon to continue the adventure!",
    "tutorial_1_pre2" : "You’ll need to pick one based on its genes. Let's learn a bit more about genes, so you know what to look for!",
    "tutorial_1_main1" : "Every Genemon inherits two versions of each gene—called <color=#0057B7>alleles</color>—one from each parent.",
    "tutorial_1_main2" : "When these two alleles are different, we call the genotype <color=#0057B7>heterozygous</color>.",
    "tutorial_1_main3" : "For example, take a look at this 'Claw' trait: one allele is for 'Small Claw', and the other is for 'Sharp Claw'. That makes it <color=#0057B7>heterozygous</color>!",
    "tutorial_1_main4" : "<color=#0057B7>Heterozygous</color> genes  might not always show both alleles in their traits, but they can pass either one to their offspring!",
    "tutorial_1_post1" : "Alright, with this in mind, select a Genemon with a <color=#0057B7>heterozygous</color> 'Claw' trait to continue your journey.",
    "selection_starter_failed_aaron" : "No, Aaronimon does not have an <color=#0057B7>heterozygous</color> 'Claw' trait! Remember, both alleles need to be different.",
    "selection_starter_failed_monkey" : "No, Monkeyshoo does not have an <color=#0057B7>heterozygous</color> 'Claw' trait! Remember, both alleles need to be different.",
    "selection_starter_success" : "Great Choice, Naboumon has an <color=#0057B7>heterozygous</color> 'Claw' trait! It will be your starting Genemon!",
    "tutorial_2_pre1" : "Oh it seems this wild Genemon is blocking our path! This Genemon seems strong!",
    "tutorial_2_pre2" : "Let's try to tame it by engaging in a Genemon Battle! Click on the Genemon to engage!",
    "confirm_battle" : "Are you ready to start the battle?",
    "tutorial_3_pre1" : "Well, it seems our Genemon is too weak. I will show you how to make a Genemon stronger by breeding it with another one!",
    "tutorial_3_main1" : "Genemons can transmit their genes to their offspring. This process is called <color=#0057B7>heredity</color>.",
    "tutorial_3_main2" : "For that to happen, we need  to breed one Genemon female with one Genemon male.",
    "tutorial_3_main3" : "The offspring created by <color=#0057B7>sexual reproduction</color> get 50%  of the gene from one parent and 50% from another",
    "tutorial_3_main4" : "This creates a new offspring that can get new traits and be stronger than its parents!",
    "tutorial_3_post1" : "Let's go ahead and breed our Genemon with another one before battling again.",
    "battle_intro" : "Wild {0} wants to battle!",
    "battle_player_turn" : "It's your turn to engage!",
    "battle_enemy_turn" : "It's {0}'s turn! It makes a move!",
    "battle_lost" : "{0} is too exhausted to continue! You were outmatched!",
    "battle_win" : "{0} was intimidated! You won the battle!",
    "claw" : "Claw",
    "small_claw" : "Small Claw",
    "small_claw_dominant" : "Small Claw : Dominant - C",
    "sharp_claw" : "Sharp Claw",
    "sharp_claw_recessive" : "Sharp Claw : Recessive - c",
    "skin" : "Skin",
    "soft_skin" : "Soft Skin",
    "soft_skin_recessive" : "Soft Skin : Recessive - s",
    "hard_skin" : "Hard Skin",
    "hard_skin_dominant" : "Hard Skin : Dominant - S",
    "color": "Color",
    "color_blue": "Color Blue",
    "color_red": "Color Red",
    "color_green": "Color Green",
    "color_yellow": "Color Yellow",
    "color_purple": "Color Purple",
    "color_cyan": "Color Cyan",
    "pattern": "Pattern",
    "no_pattern": "No Pattern",
    "disc_pattern": "Disc Pattern",
    "line_pattern": "Line Pattern",
    "disc_line_pattern": "Disc-Line Pattern",
    "hunter_focus": "Hunter's Focus",
    "hunter_focus_description": "Activates a mini-game before your move. If successful, it never misses!",
    "windstep": "Windstep",
    "windstep_description": "Activates a mini-game before receiving a move. If successful, avoids the move!",
    "sharp_claw_description": "Activates a mini-game before your move. If successful, its impact is doubled!.",
    "hard_skin_description": "Activates a mini-game before receiving a move. If successful, reduces the impact by half!",
    "biteback": "Bite Back",
    "biteback_description": "When receiving a move, reflects half of its impact back to the opponent!",
    "opponent_screen_title": "Your Opponent",
    "opponent_screen_required_traits_title": "Traits required to defeat this Genemon:",
    "first_parent_selection_dialog": "Select a Genemon that will increase your chances to obtain the desired traits.",
    "first_parent_confirm_selection": "Are you sure you want to select this Genemon?",
    "second_parent_selection_dialog": "Select another Genemon to breed with to get the desired traits.",
    "second_parent_confirm_selection": "Are you sure you want to breed {0} with {1}?",
    "recessive_trait_description": "A Recessive Trait will only be expressed in a gene where both alleles are recessive.",
    "dominant_trait_description": "A Dominant Trait will be expressed even if a single dominant allele is present in the gene.",
    "incomplete_dominant_trait_description": "An Incomplete Dominant Trait will be expressed even if a single dominant allele is present in the gene.",
    "codominant_trait_description": "An Co-Dominant Trait will be expressed even if a single dominant allele is present in the gene.",
    "tutorial_4_pre1" : "This is a <color=#0057B7>Punnett Square</color>. It’s a chart that shows the possible <color=#0057B7>genotype</color> combinations in offspring from two parents.",
    "tutorial_4_pre2" : "An offspring inherits two alleles for each trait—one from each parent. These alleles can be expressed in several ways.",
    "tutorial_4_pre3" : "'Sharp Claw' is a <color=#0057B7>recessive</color> trait, which means it only shows up if the Genemon has two copies of the recessive allele.",
    "tutorial_4_pre4" : "A <color=#0057B7>Homozygous genotype</color> means that both alleles are the same—this is required for expressing <color=#0057B7>recessive</color> alleles.",
    "tutorial_4_pre5" : "Now it’s your turn! Select in the <color=#0057B7>Punnett Square</color> the combination of alleles that would give the offspring the <color=#0057B7>recessive</color> 'Sharp Claw' trait.",
    "egg_screen_instruction" : "Click on the egg until it hatches!",
    "tutorial_5_pre1" : "This time, let’s focus on <color=#0057B7>dominant</color> alleles. These alleles are strong—they show up even if there’s only one of them.",
    "tutorial_5_pre2" : "If a Genemon has at least one <color=#0057B7>dominant</color> allele for a trait, that trait will be expressed. 'Hard Skin' is a <color=#0057B7>dominant</color> trait. ",
    "tutorial_5_pre3" : "The trait you can actually see on a Genemon, like its claws or skin, is called the <color=#0057B7>phenotype</color>.",
    "tutorial_5_pre4" : "So while the <color=#0057B7>genotype</color> is  the instructions, the <color=#0057B7>phenotype</color> is the final result we can observe.",
    "tutorial_5_pre5" : "Now it’s your turn! Select in the <color=#0057B7>Punnett Square</color> the combination of alleles that would give the offspring the <color=#0057B7>dominant</color> 'Hard Skin' trait.",
    "tutorial_6_pre1" : "Oh no, It seems those two Genemons have lost their baby!",
    "tutorial_6_pre2" : "Before we help them finding their baby, let's learn about something called <color=#0057B7>incomplete dominance</color>.",
    "tutorial_6_main1" : "Each Genemon has two alleles for each trait—one from each parent.",
    "tutorial_6_main2" : "These alleles are different versions of a gene. For example, one might code for a red color, and another for green.",
    "tutorial_6_main3" : "The Color trait is <color=#0057B7>incomplete dominant</color>. That means neither allele fully takes over. Instead, they blend together in the offspring.",
    "tutorial_6_main4" : "So if a red-colored Genemon and a green-colored Genemon have a baby, the result might be yellow!",
    "tutorial_6_main5" : "This is different from <color=#0057B7>dominance</color> where only one trait shows up, or <color=#0057B7>recessive</color> where both alleles need to match.",
    "tutorial_6_main6" : "So when you see a blended color, it means the Genemon has one allele from each color—a <color=#0057B7>heterozygous pair showing incomplete dominance</color>.",
    "tutorial_6_post1" : "You’re now ready to find the lost Genemon based on <color=#0057B7>incomplete dominance</color>!",
    "tutorial_6_post2" : "Look carefully at the parents' colors and think about how their alleles might mix together. Let’s help them reunite!",
    "conveyor_belt_instruction" : "Tap on the green button to pause the conveyor belt when an offspring is in the pick up zone.",
    "conveyor_belt_confirm_selection": "Are you sure you want to pick up this Genemon?",
    "conveyor_belt_success_dialog_1": "Congratulations, you found the offspring of {0} and {1}!",
    "conveyor_belt_success_dialog_2": "They are very happy so they let you pass and continue your journey!",
    "conveyor_belt_failed_dialog_1": "Hum, it seems {0} is not the right offspring of these two Genemons.",
    "conveyor_belt_failed_dialog_2": "They are a bit sad but let's try to find their offspring!",
    "tutorial_7_pre1" : "Oh No! It seems these two Genemons also lost their offspring!",
    "tutorial_7_pre2" : "You might have noticed that these Genemons have an interesting skin pattern, which is a another trait of Genemons.",
    "tutorial_7_pre3" : "In order to help them we need to learn about <color=#0057B7>codominance</color>.",
    "tutorial_7_main1" : "<color=#0057B7>Codominance</color> occurs when both alleles in a gene pair are fully expressed. The pattern on a Genemon is a <color=#0057B7>codominant gene</color>.",
    "tutorial_7_main2" : "When a Genemon inherits different <color=#0057B7>codominant alleles</color> the result is a <color=#0057B7>phenotype</color> that displays both traits simultaneously.",
    "tutorial_7_post1" : "You’re now ready to find the lost offspring based on <color=#0057B7>codominance</color>.",
    "tutorial_7_post2" : "Look carefully at the parents' pattern. Let’s help them reunite!",
    "tutorial_8_pre1" : "Wow, this is one of the three legendary Genemons: Aerolythar! It seems that he wants to battle.",
    "tutorial_8_pre2" : "This is a special Genemon—it possesses 'Windstep', a <color=#0057B7>polygenetic</color> trait.",
    "tutorial_8_pre3" : "This trait enables this Genemon to avoid an incoming move!",
    "tutorial_8_pre4" : "To stand a chance, we need to learn how multiple genes can work together to create more powerful traits!",
    "tutorial_8_main1" : "<color=#0057B7>Sexual reproduction</color> increases genetic variation—that means every baby Genemon is a unique mix of genes from their parents.",
    "tutorial_8_main2" : "Some traits, like color or claws, are controlled by a single gene.",
    "tutorial_8_main3" : "But traits like 'Windstep' are more complex—they are <color=#0057B7>polygenetic</color>, meaning they come from the combination of several genes.",
    "tutorial_8_main4" : "For example, Aerolythar has the trait 'Windstep' because it carries Color Cyan, Disc-Line Pattern and Sharp Claw.",
    "tutorial_8_main5" : "Think of it like building a puzzle: each parent provides some of the pieces, and only the right mix creates the full picture.",
    "tutorial_8_post1" : "You’ve learned how mixing different genes can create powerful <color=#0057B7>polygenetic traits</color>!",
    "tutorial_8_post2" : "Now, let's try to select and breed two Genemons to get the polygenetic trait <color=#e97b36>Hunter's Focus</color>.",
    "tutorial_8_post3" : "<color=#e97b36>Hunter's focus</color> gives a Genemon the ability to always hit the target, even if the target possess Windstep! This is a required trait to beat a foe like Aerolythar!",
    "tutorial_9_pre1" : "Select the combination of alleles that would give the offspring the desired trait.",
    "museum_dialog" : "Welcome to the Museum! Here you can view all the Genemons you've discovered.",
    "arena_dialog1" : "Welcome to the Arena! Here you can test your Genemons breeding and battling skills.",
    "arena_dialog2" : "You will discover new Genemons and face exciting challenges.",
    "arena_dialog3" : "Round {0} starts now! Your opponent is: {1}!",
    "arena_dialog4" : "Congratulations on completing this round of the Arena! This was a tough challenge, but you did it!",
    "arena_dialog5" : "Are you ready for the next round?",
    "arena_dialog_win1" : "Congratulations on completing the Arena! You have proven your skills in breeding and battling.",
    "arena_dialog_win2" : "You are now a true Genemons Master!",
    "arena_dialog_win3" : "You can always return to the Arena to challenge yourself again and try to discover all the Genemons.",
    "arena_dialog_lost1" : "You have lost this arena challenge. Don't be discouraged, you can always try again!",
    "trait_dominant": "Dominant Trait",
    "trait_recessive": "Recessive Trait",
    "trait_polygenetic": "Polygenetic Trait",
    "dominant": "Dominant",
    "recessive": "Recessive",
    "incomplete_dominant": "Incomplete Dominant",
    "phenotypes": "Phenotypes",
    "genotypes": "Genotypes",
    "sharp_claw_mini_game_instruction": "Click at the right time !",
    "hard_skin_mini_game_instruction": "Click fast to fill the bar!",
    "hunter_focus_mini_game_instruction": "Click when the circle is close to the center!",
    "windstep_mini_game_instruction": "Click when the circle is close to the edge!",
    "egg_hatching_tutorial_1" : "Check out the Genemon Encyclopedia to learn more about traits and their effects."
  }
}
